# a = 10 / 3
# округляет кол. точек
# print(round(a, 2))
# ----------------------------------------
# позволяет писать код пайтона в терминале
# a = eval(input('>>>>'))
# print(a)


# ------------------------------------------------------------------------------
    
# # w - добавляет файл или перезаписывает новый если такой уже имеется
# file = open("text2.txt", "a" - добавляет данные в файл")
# file.write("azim privet")
# file.write("!!!")



# file.close()
# -------------------------------------------------















 
