
# сравнивает множество и выводит отличие 
# farm_1 = {"dog", "cat", "mouse", "sheep"}
# farm_2 = {"cow", "horse", "donkey", "cat", "dog"}
# farm_3 = farm_2.difference(farm_1)
# print(farm_3)
# -----------------------------------------------
# удаление через поп в множестве
# a = {1,2,4,6}
# a.add(7)
# print(a)
# a.pop()
# print(a)
# ---------------------------------------------------------------

# menu = {'lagman': 120, 'plov': '120', 'borsh': 100}
# menu1 = {'drinks': ['cocacola', 'sprite', 'fanta']}
# menu.update(menu1)
# print(menu)
# -----------------------------------------------------------
# set1 = {'.add = добавляет элемент в множество' '.remove удаляет объект из множества' '.clear удаляет все внутри множества' 
# '.pop - удаляет случайный объект из множества' '.difference - сравнивает оригинальное множество с * и возращает объекты которых нет в *'}
# --------------------------------------------------------

# set2 = {'.clear - удаляет все объекты из словаря' '.keys - возращает список всех значений'
# '.items - возращает список всех ключей и их значение', 'get - получить значение по (*)' 
# '.values - возращает список всех значений'}
# set1.intersection(set2)
# print(set1)

# -------------------------------------------------------------------------
# setdefault - добавление данных в словарь
# slovar = {}
# for i in range(3):
#     a = input("name : ")
#     b = input("password :")    
#     slovar.setdefault(a,b)
# for key, value in slovar.items():
#     print(f'name - {key}, password- {value}')


    
# ---------------------------------------------------------------------------
# Метод перебора словаря и сравнение значение ключей на четность
# dict1 = {'a': 5, 'b': 3, 'c': 8, 'd': 14}
# for k, v in dict1.items():
#     if v % 3 == 0:
#         print("hi")
#     elif v % 5 == 0:
#         print('bye') 
# -----------------------------------------------
# способ объединения словарей
# dict_a = {1:10, 2:20}
# dict_b = {3:30, 4:40}
# dict_c = {5:50, 6:60}
# b = {}
# for i in (dict_a, dict_b, dict_c):
#     b.update(i)
#     print(b)
# ------------------------------------------

# Отсортируйте словарь по значению в порядке возрастания и убывания.

# Вариант решения
# Импортируем нужный модуль и объявляем словарь:

# import operator
# d = {1: 2, 3: 4, 4: 3, 2: 1, 0: 0}

# Сортируем в порядке возрастания:

# result = dict(sorted(d.items(), key=operator.itemgetter(1)))

# И в порядке убывания:

# result = dict(sorted(d.items(), key=operator.itemgetter(1), reverse=True))
# -------------------------------------------------------------------------

        # пример как создать пустое множество и добавить туда объект
# b = set()
# for i in range(5):
#     a = int(input("Введите число >>> : "))
#     b.add(a)
# print(min(b))
# ------------------------------------------------
