
#     text1 = "salam"
#     print(text1.capitalize())
    # делает первую букву заглавной

# text = "                   azim                     ".strip()  . убирает все пробели .lstrip() "убирает пробелы слева"
# print(text)


# text = (".....")
# print (text.count("считает количество слов"))

# text = 'text'
# print(text.isalpha())              проверяет если в строке все буквы (text.isdigit()) проверка строки на числа


# -----------------------------------------------------

# (split.(переменная))считает количество слов
#  (len(переменная)) количество букв символов даже пробелов

# (text.replace("st"))
# -----------------------------------------------------


# a = ("asd ").center(n)   делает n количество пробелов
# print(a)

# -----------------------------------------------------


# a = "azim \           \ для переноса строки на новый столбик ,для маленького редактора
#  asdasd asddas \
#   asdasdasdadasdasdasdasdasdasdasdaasd \
#   "
# print(a)
# -----------------------------------------------------


# a = input(".....: ")  проеверяет начинается ли строка с определенной буквы
# print(a.startswith("a"))
# -----------------------------------------------------

# a = input("..... :") проверяет конец строки на определонный символ
# print(a.endswith("м"))

# -----------------------------------------------------

# a = input("   :") делает каждую строку с заглавной буквой
# print(a.title())


# -----------------------------------------------------

# text= 'Love thy neighbor'
# # разделяем строку
# print(text.split())
# grocery = 'Milk, Chicken, Bread'
# # разделяем запятой
# print(grocery.split(', '))
# # разделяем двоеточием
# print(grocery.split(':'))

# text= 'Привет, как тебя зовут?'

# print(text.split())
# grocery = 'Меня зовут Азим'

# print(grocery.split(','))

# -----------------------------------------------------


# метод работы с ф строкой и циклом
# a = 5
# for i in range(1,10):
#     print(f"{i} * {a} = {i * a}")


# пример работы с f строкой
# a = {"Azim": "medic", "nuric": "torgash", "aibek": "kop", "naufal": "pevec", "rauf": "programmist"}
# for key, value in a.items():
#     print(f'здравствуйте - {key}, отличная проффесия - {value}')

# -----------------------------------------------------
# пример как узнать палиндром

# def generete_pass(word, side):
#     s = str(side)
#     password = s + word[:: -1 ] + s
#     return password


# print(generete_pass("sitis", "sitis"))
# ---------------------------------------------------------------




















